{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "name": "conv1/kernel", "shape": [3, 3, 3, 32]}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "name": "conv1_bn/gamma", "shape": [32]}, {"dtype": "float32", "name": "conv1_bn/beta", "shape": [32]}, {"dtype": "float32", "name": "conv1_bn/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "conv1_bn/moving_variance", "shape": [32]}]}, {"paths": ["group3-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_1/depthwise_kernel", "shape": [3, 3, 32, 1]}]}, {"paths": ["group4-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_10/depthwise_kernel", "shape": [3, 3, 512, 1]}]}, {"paths": ["group5-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_10_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_10_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_10_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_10_bn/moving_variance", "shape": [512]}]}, {"paths": ["group6-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_11/depthwise_kernel", "shape": [3, 3, 512, 1]}]}, {"paths": ["group7-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_11_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_11_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_11_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_11_bn/moving_variance", "shape": [512]}]}, {"paths": ["group8-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_12/depthwise_kernel", "shape": [3, 3, 512, 1]}]}, {"paths": ["group9-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_12_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_12_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_12_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_12_bn/moving_variance", "shape": [512]}]}, {"paths": ["group10-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_13/depthwise_kernel", "shape": [3, 3, 1024, 1]}]}, {"paths": ["group11-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_13_bn/gamma", "shape": [1024]}, {"dtype": "float32", "name": "conv_dw_13_bn/beta", "shape": [1024]}, {"dtype": "float32", "name": "conv_dw_13_bn/moving_mean", "shape": [1024]}, {"dtype": "float32", "name": "conv_dw_13_bn/moving_variance", "shape": [1024]}]}, {"paths": ["group12-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_1_bn/gamma", "shape": [32]}, {"dtype": "float32", "name": "conv_dw_1_bn/beta", "shape": [32]}, {"dtype": "float32", "name": "conv_dw_1_bn/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "conv_dw_1_bn/moving_variance", "shape": [32]}]}, {"paths": ["group13-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_2/depthwise_kernel", "shape": [3, 3, 64, 1]}]}, {"paths": ["group14-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_2_bn/gamma", "shape": [64]}, {"dtype": "float32", "name": "conv_dw_2_bn/beta", "shape": [64]}, {"dtype": "float32", "name": "conv_dw_2_bn/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "conv_dw_2_bn/moving_variance", "shape": [64]}]}, {"paths": ["group15-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_3/depthwise_kernel", "shape": [3, 3, 128, 1]}]}, {"paths": ["group16-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_3_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_3_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_3_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_3_bn/moving_variance", "shape": [128]}]}, {"paths": ["group17-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_4/depthwise_kernel", "shape": [3, 3, 128, 1]}]}, {"paths": ["group18-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_4_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_4_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_4_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_4_bn/moving_variance", "shape": [128]}]}, {"paths": ["group19-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_5/depthwise_kernel", "shape": [3, 3, 256, 1]}]}, {"paths": ["group20-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_5_bn/gamma", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_5_bn/beta", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_5_bn/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_5_bn/moving_variance", "shape": [256]}]}, {"paths": ["group21-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_6/depthwise_kernel", "shape": [3, 3, 256, 1]}]}, {"paths": ["group22-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_6_bn/gamma", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_6_bn/beta", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_6_bn/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_6_bn/moving_variance", "shape": [256]}]}, {"paths": ["group23-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_7/depthwise_kernel", "shape": [3, 3, 512, 1]}]}, {"paths": ["group24-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_7_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_7_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_7_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_7_bn/moving_variance", "shape": [512]}]}, {"paths": ["group25-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_8/depthwise_kernel", "shape": [3, 3, 512, 1]}]}, {"paths": ["group26-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_8_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_8_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_8_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_8_bn/moving_variance", "shape": [512]}]}, {"paths": ["group27-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_9/depthwise_kernel", "shape": [3, 3, 512, 1]}]}, {"paths": ["group28-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_dw_9_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_9_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_9_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_9_bn/moving_variance", "shape": [512]}]}, {"paths": ["group29-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_1/kernel", "shape": [1, 1, 32, 64]}]}, {"paths": ["group30-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_10/kernel", "shape": [1, 1, 512, 512]}]}, {"paths": ["group31-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_10_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_10_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_10_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_10_bn/moving_variance", "shape": [512]}]}, {"paths": ["group32-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_11/kernel", "shape": [1, 1, 512, 512]}]}, {"paths": ["group33-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_11_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_11_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_11_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_11_bn/moving_variance", "shape": [512]}]}, {"paths": ["group34-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_12/kernel", "shape": [1, 1, 512, 1024]}]}, {"paths": ["group35-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_12_bn/gamma", "shape": [1024]}, {"dtype": "float32", "name": "conv_pw_12_bn/beta", "shape": [1024]}, {"dtype": "float32", "name": "conv_pw_12_bn/moving_mean", "shape": [1024]}, {"dtype": "float32", "name": "conv_pw_12_bn/moving_variance", "shape": [1024]}]}, {"paths": ["group36-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_13/kernel", "shape": [1, 1, 1024, 1024]}]}, {"paths": ["group37-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_13_bn/gamma", "shape": [1024]}, {"dtype": "float32", "name": "conv_pw_13_bn/beta", "shape": [1024]}, {"dtype": "float32", "name": "conv_pw_13_bn/moving_mean", "shape": [1024]}, {"dtype": "float32", "name": "conv_pw_13_bn/moving_variance", "shape": [1024]}]}, {"paths": ["group38-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_1_bn/gamma", "shape": [64]}, {"dtype": "float32", "name": "conv_pw_1_bn/beta", "shape": [64]}, {"dtype": "float32", "name": "conv_pw_1_bn/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "conv_pw_1_bn/moving_variance", "shape": [64]}]}, {"paths": ["group39-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_2/kernel", "shape": [1, 1, 64, 128]}]}, {"paths": ["group40-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_2_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv_pw_2_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv_pw_2_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv_pw_2_bn/moving_variance", "shape": [128]}]}, {"paths": ["group41-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_3/kernel", "shape": [1, 1, 128, 128]}]}, {"paths": ["group42-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_3_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv_pw_3_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv_pw_3_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv_pw_3_bn/moving_variance", "shape": [128]}]}, {"paths": ["group43-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_4/kernel", "shape": [1, 1, 128, 256]}]}, {"paths": ["group44-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_4_bn/gamma", "shape": [256]}, {"dtype": "float32", "name": "conv_pw_4_bn/beta", "shape": [256]}, {"dtype": "float32", "name": "conv_pw_4_bn/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "conv_pw_4_bn/moving_variance", "shape": [256]}]}, {"paths": ["group45-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_5/kernel", "shape": [1, 1, 256, 256]}]}, {"paths": ["group46-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_5_bn/gamma", "shape": [256]}, {"dtype": "float32", "name": "conv_pw_5_bn/beta", "shape": [256]}, {"dtype": "float32", "name": "conv_pw_5_bn/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "conv_pw_5_bn/moving_variance", "shape": [256]}]}, {"paths": ["group47-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_6/kernel", "shape": [1, 1, 256, 512]}]}, {"paths": ["group48-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_6_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_6_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_6_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_6_bn/moving_variance", "shape": [512]}]}, {"paths": ["group49-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_7/kernel", "shape": [1, 1, 512, 512]}]}, {"paths": ["group50-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_7_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_7_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_7_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_7_bn/moving_variance", "shape": [512]}]}, {"paths": ["group51-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_8/kernel", "shape": [1, 1, 512, 512]}]}, {"paths": ["group52-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_8_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_8_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_8_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_8_bn/moving_variance", "shape": [512]}]}, {"paths": ["group53-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_9/kernel", "shape": [1, 1, 512, 512]}]}, {"paths": ["group54-shard1of1"], "weights": [{"dtype": "float32", "name": "conv_pw_9_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_9_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_9_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_9_bn/moving_variance", "shape": [512]}]}, {"paths": ["group55-shard1of1"], "weights": [{"dtype": "float32", "name": "dense_1/kernel", "shape": [1024, 7]}, {"dtype": "float32", "name": "dense_1/bias", "shape": [7]}]}], "modelTopology": {"training_config": {"sample_weight_mode": null, "optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "decay": 0.0, "beta_2": 0.9990000128746033, "epsilon": 1e-08, "beta_1": 0.8999999761581421}}, "metrics": ["accuracy"], "loss": "categorical_crossentropy", "loss_weights": null}, "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "sparse": false, "name": "input_1"}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "name": "conv1", "filters": 32, "bias_constraint": null, "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": false, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}, "name": "conv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv1_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": false, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": false, "name": "conv1_relu"}, "name": "conv1_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "name": "conv_dw_1", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "same", "activation": "linear", "activity_regularizer": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "trainable": false, "bias_regularizer": null, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_dw_1_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": false, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": false, "name": "conv_dw_1_relu"}, "name": "conv_dw_1_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "name": "conv_pw_1", "filters": 64, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "linear", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": false, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}, "name": "conv_pw_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_pw_1_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": false, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": false, "name": "conv_pw_1_relu"}, "name": "conv_pw_1_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "name": "conv_dw_2", "strides": [2, 2], "bias_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "same", "activation": "linear", "activity_regularizer": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "trainable": false, "bias_regularizer": null, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_dw_2_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": false, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": false, "name": "conv_dw_2_relu"}, "name": "conv_dw_2_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "name": "conv_pw_2", "filters": 128, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "linear", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": false, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}, "name": "conv_pw_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_pw_2_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": false, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": false, "name": "conv_pw_2_relu"}, "name": "conv_pw_2_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "name": "conv_dw_3", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "same", "activation": "linear", "activity_regularizer": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "trainable": false, "bias_regularizer": null, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_dw_3_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": false, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_3_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": false, "name": "conv_dw_3_relu"}, "name": "conv_dw_3_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "name": "conv_pw_3", "filters": 128, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "linear", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": false, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}, "name": "conv_pw_3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_pw_3_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": false, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_3_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": false, "name": "conv_pw_3_relu"}, "name": "conv_pw_3_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "name": "conv_dw_4", "strides": [2, 2], "bias_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "same", "activation": "linear", "activity_regularizer": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "trainable": false, "bias_regularizer": null, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_4"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_dw_4_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": false, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_4_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_4_relu"}, "name": "conv_dw_4_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "name": "conv_pw_4", "filters": 256, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "linear", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}, "name": "conv_pw_4"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_pw_4_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_4_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_4_relu"}, "name": "conv_pw_4_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "name": "conv_dw_5", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "same", "activation": "linear", "activity_regularizer": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_5"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_dw_5_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_5_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_5_relu"}, "name": "conv_dw_5_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "name": "conv_pw_5", "filters": 256, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "linear", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}, "name": "conv_pw_5"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_pw_5_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_5_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_5_relu"}, "name": "conv_pw_5_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "name": "conv_dw_6", "strides": [2, 2], "bias_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "same", "activation": "linear", "activity_regularizer": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_6"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_dw_6_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_6_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_6_relu"}, "name": "conv_dw_6_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "name": "conv_pw_6", "filters": 512, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "linear", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}, "name": "conv_pw_6"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_pw_6_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_6_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_6_relu"}, "name": "conv_pw_6_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "name": "conv_dw_7", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "same", "activation": "linear", "activity_regularizer": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_7"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_dw_7_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_7_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_7_relu"}, "name": "conv_dw_7_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "name": "conv_pw_7", "filters": 512, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "linear", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}, "name": "conv_pw_7"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_pw_7_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_7_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_7_relu"}, "name": "conv_pw_7_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "name": "conv_dw_8", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "same", "activation": "linear", "activity_regularizer": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_8"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_dw_8_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_8_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_8_relu"}, "name": "conv_dw_8_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "name": "conv_pw_8", "filters": 512, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "linear", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}, "name": "conv_pw_8"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_pw_8_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_8_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_8_relu"}, "name": "conv_pw_8_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "name": "conv_dw_9", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "same", "activation": "linear", "activity_regularizer": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_9"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_dw_9_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_9_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_9_relu"}, "name": "conv_dw_9_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "name": "conv_pw_9", "filters": 512, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "linear", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}, "name": "conv_pw_9"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_pw_9_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_9_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_9_relu"}, "name": "conv_pw_9_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "name": "conv_dw_10", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "same", "activation": "linear", "activity_regularizer": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_10"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_dw_10_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_10_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_10_relu"}, "name": "conv_dw_10_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "name": "conv_pw_10", "filters": 512, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "linear", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}, "name": "conv_pw_10"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_pw_10_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_10_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_10_relu"}, "name": "conv_pw_10_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "name": "conv_dw_11", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "same", "activation": "linear", "activity_regularizer": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_11"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_dw_11_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_11_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_11_relu"}, "name": "conv_dw_11_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "name": "conv_pw_11", "filters": 512, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "linear", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}, "name": "conv_pw_11"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_pw_11_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_11_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_11_relu"}, "name": "conv_pw_11_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "name": "conv_dw_12", "strides": [2, 2], "bias_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "same", "activation": "linear", "activity_regularizer": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_12"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_dw_12_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_12_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_12_relu"}, "name": "conv_dw_12_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "name": "conv_pw_12", "filters": 1024, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "linear", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}, "name": "conv_pw_12"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "conv_pw_12_bn", "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_pw_12_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_12_relu"}, "name": "conv_pw_12_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "name": "conv_dw_13", "strides": [1, 1],